[
  {
  "title": "RikRok – Tinder for Research Papers",
  "description": "An AI-powered research discovery app that helps users find, swipe, and save AI papers from arXiv. Built with React Native and integrated with Anthropic's Claude for paper summarization and recommendation. Designed to make exploring new research engaging, intuitive, and conversational.",
  "tags": ["🏆 1st Place · UMD × Anthropic", "React Native", "Anthropic", "Claude", "AI", "arXiv", "Mobile", "JavaScript"],
  "repoUrl": "https://github.com/dalu1234/rikrok",
  "liveUrl": null,
  "image": "assets/images/1110.gif",
  "featured": true
},
{
  "title": "Quest – AI-Generated Daily Campus Challenges",
  "description": "Quest creates short, personalized daily challenges that help students explore campus, build habits, and boost well-being. Powered by AI-generated micro-missions, the app turns each day into a small adventure with intentional, growth-oriented actions.",
  "tags": ["AI", "Campus Life", "Well-being", "React Native", "Student Engagement", "Daily Challenges"],
  "repoUrl": null,
  "liveUrl": null,
  "image": "assets/images/buest.gif",
  "featured": true
},
{
  "title": "Classroom TA – Multi-Agent Teaching Assistant",
  "description": "An AI-powered multi-agent teaching assistant designed to support overstaffed classrooms. It dynamically coordinates lesson planning, grading, and student Q&A through a team of specialized AI agents that collaborate to reduce teacher workload and improve learning engagement.",
  "tags": ["AI Agents", "Education", "Multi-Agent Systems", "Teacher Assistant", "LLM", "Automation"],
  "repoUrl": "https://github.com/Dalu1234/Teacher-Assistant",
  "liveUrl": null,
  "image": "assets/images/ba.gif",
  "featured": true
}

,
  {
  "title": "Conversational RAG System",
  "description": "A full-stack conversational AI application using a Retrieval-Augmented Generation (RAG) architecture. The backend is built with Python, Flask, and LangChain, and the frontend is a responsive chat interface using HTML, and Tailwind CSS. It includes a feedback mechanism integrated with LangSmith for monitoring and improvement.",
  "tags": ["Python", "Flask", "LangChain", "RAG", "JavaScript", "Tailwind CSS", "AI"],
  "repoUrl": "https://github.com/dalu1234/ryo",
  "image": "assets/images/rag-terminal.png"
},

  {
  "title": "Red Team DeepSeek",
  "description": "A Python-based tool for red teaming large language models, specifically DeepSeek. It allows users to engineer prompts with various attack strategies to test the model's vulnerabilities and robustness against malicious inputs. The tool logs the results to create a dataset for analyzing model performance and safety.",
  "tags": ["Python", "Red Teaming", "LLM", "AI Security", "DeepSeek"],
  "repoUrl": "https://github.com/jal355/t4g_redteam_deepseek",
  "liveUrl": null,
  "image":  "assets/images/redteamDeepSeek.png"
},
  
{
 "title": "PerspectiveAPI Hate Speech Classification",
 "description": "A project that implements and evaluates different machine learning models for hate speech classification, using the PerspectiveAPI dataset. The project explores various text feature engineering techniques and compares the performance of models like Logistic Regression and Transformers.",
 "tags": ["Python", "Machine Learning", "Natural Language Processing", "Hate Speech Detection"],
 "repoUrl": "https://github.com/dalu1234/t4g-mini-project-1---perspectiveapi-hate-speech-classification",
 "liveUrl": null,
 "image": "assets/images/hate-speech-classification.png"
},
  
{
"title": "Privacy Analyzer (Prof P)",
"description": "A Chrome Extension that helps users understand complex privacy policies by generating AI-powered summaries and calculating readability scores for highlighted text.",
"tags": ["JavaScript", "Chrome Extension", "AI", "API"],
"repoUrl": "https://github.com/dalu1234/prof-p",
 "liveUrl": null,
 "image": "assets/images/p.png"
 },

 {
    "title": "FoodConnect: Volunteer Coordination System",
    "description": "A volunteer management system designed for community food organizations, including food banks and food pantries. This application simplifies the process of volunteer sign-ups, tracking, and prioritization using a robust Java-based architecture.",
    "tags": ["Java", "Swing", "GUI"],
    "repoUrl": "https://github.com/dalu1234/foodconnect",
    "liveUrl": null,
    "image": "assets/images/food.png"
},

{
  "title": "Rubix",
  "description": "A speed-based mathematical puzzle game built with the Godot engine. The objective is to reach a randomly generated target number starting from zero. Players use four distinct operations (increment, decrement, multiply, divide), where the value of each operation increases with every use, adding a strategic layer to the challenge. The game tracks the player's completion time, encouraging fast and efficient problem-solving.",
  "tags": ["Godot", "GDScript", "Game", "Puzzle", "Math"],
  "repoUrl": "https://github.com/dalu1234/rubix",
  "liveUrl": null,
  "image": "assets/images/rubix.png"
}

]